In [1]:
import pandas as pd

In [2]:
df4 = pd.DataFrame([dict(b='mammal', c=5.0, d='horse', e=13),
                    dict(b='mammal', c=1.4, d='cat', e=11),
                    dict(b='mammal', c=1.2, d='dog'),
                    dict(b='fish', c=0.1, d='goldfish'),
                    dict(b='reptile', c=2.3, d='snake', e=9),
                    dict(b='fish', c=1.8, d='koi', e=10),
                    dict(b='fish', c=0.8, d='carp')])

## GroupBy and Aggregation

In [3]:
df4

         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN

In [4]:
gb = df4.groupby('b')

In [5]:
gb

In [6]:
gb.mean()

                c     e
b
fish     0.900000  10.0
mammal   2.533333  12.0
reptile  2.300000   9.0

In [8]:
gb.aggregate({'c': ['min', 'sum']})

           c
         min  sum
b
fish     0.1  2.7
mammal   1.2  7.6
reptile  2.3  2.3

In [9]:
def func(col):
    return sum(i*col.iloc[i,] for i in range(len(col)))

In [10]:
gb.agg(func)

           c    e
b
fish     3.4  NaN
mammal   3.8  NaN
reptile  0.0  0.0

In [11]:
df4

         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN

$fish = 0 \cdot 0.1 + 1 \cdot 1.8 + 2 \cdot 0.8 = 3.4$

$reptile = 0 \cdot 2.3 = 0$

$mammal = 0 \cdot 5.0 + 1 \cdot 1.4 + 2 \cdot 1.2 = 3.8$

## Merge, Join, etc.

In [16]:
fn2 = "https://raw.githubusercontent.com/sebwink/Integrated_Bioinformatics/master/example_data/example_df.csv"

In [17]:
df2 = pd.read_csv(fn2, sep=',')

In [18]:
df2

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [19]:
df4

         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN

In [20]:
df4.merge(df2, on=['d'])

      b_x  c_x      d   e_x  a  b_y  c_y   e_y
0  mammal  5.0  horse  13.0  2    3  5.0  13.0
1  mammal  1.4    cat  11.0  3    1  1.4  11.0
2  mammal  1.2    dog   NaN  4    9  1.2   NaN

In [22]:
df4.merge(df2, on=['d', 'c', 'e'])

      b_x    c      d     e  a  b_y
0  mammal  5.0  horse  13.0  2    3
1  mammal  1.4    cat  11.0  3    1
2  mammal  1.2    dog   NaN  4    9

In [23]:
df4.merge(df2, on=['b'])

Empty DataFrame
Columns: [b, c_x, d_x, e_x, a, c_y, d_y, e_y]
Index: []

In [24]:
pd.merge(df4, df3, on=['d'])

      b_x  c_x      d   e_x  a  b_y  c_y   e_y
0  mammal  5.0  horse  13.0  2    3  5.0  13.0
1  mammal  1.4    cat  11.0  3    1  1.4  11.0
2  mammal  1.2    dog   NaN  4    9  1.2   NaN

In [25]:
pd.merge(df4, df3, on=['d'], how='outer')

       b_x  c_x         d   e_x    a   b_y  c_y   e_y
0   mammal  5.0     horse  13.0  2.0   3.0  5.0  13.0
1   mammal  1.4       cat  11.0  3.0   1.0  1.4  11.0
2   mammal  1.2       dog   NaN  4.0   9.0  1.2   NaN
3     fish  0.1  goldfish   NaN  NaN   NaN  NaN   NaN
4  reptile  2.3     snake   9.0  NaN   NaN  NaN   NaN
5     fish  1.8       koi  10.0  NaN   NaN  NaN   NaN
6     fish  0.8      carp   NaN  NaN   NaN  NaN   NaN
7      NaN  NaN  tortoise   NaN  5.0  12.0  0.8   NaN
8      NaN  NaN    rabbit   NaN  6.0   2.0  2.3   9.0

In [26]:
df4['a'] = pd.Series(range(len(df4)))

In [27]:
df4

         b    c         d     e  a
0   mammal  5.0     horse  13.0  0
1   mammal  1.4       cat  11.0  1
2   mammal  1.2       dog   NaN  2
3     fish  0.1  goldfish   NaN  3
4  reptile  2.3     snake   9.0  4
5     fish  1.8       koi  10.0  5
6     fish  0.8      carp   NaN  6

In [29]:
pd.concat([df4,df2])

   a        b    c         d     e
0  0   mammal  5.0     horse  13.0
1  1   mammal  1.4       cat  11.0
2  2   mammal  1.2       dog   NaN
3  3     fish  0.1  goldfish   NaN
4  4  reptile  2.3     snake   9.0
5  5     fish  1.8       koi  10.0
6  6     fish  0.8      carp   NaN
0  2        3  5.0     horse  13.0
1  3        1  1.4       cat  11.0
2  4        9  1.2       dog   NaN
3  5       12  0.8  tortoise   NaN
4  6        2  2.3    rabbit   9.0

## References

For further information and examples, see https://pandas.pydata.org/pandas-docs/stable/merging.html